benchmark/time.txt

------ ROUND 1 - Insecure publish time ------

Running 2m test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.740ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.91ms    1.87ms  21.62ms   99.09%
    Req/Sec    10.39     31.02   111.00     89.90%
  1201 requests in 2.00m, 111.19KB read
Requests/sec:     10.01
Transfer/sec:      0.93KB

------ ROUND 2 - Insecure query time ------

Running 2m test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.393ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.30ms  562.36us   3.07ms   71.43%
    Req/Sec    10.78     32.20   111.00     89.90%
  1201 requests in 2.00m, 808.86KB read
Requests/sec:     10.01
Transfer/sec:      6.74KB

------ ROUND 3 - Secure publish time ------

Running 2m test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 2.042ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.26ms    2.90ms  44.38ms   98.45%
    Req/Sec    10.52     31.40   111.00     89.89%
  1201 requests in 2.00m, 111.19KB read
Requests/sec:     10.01
Transfer/sec:      0.93KB

------ ROUND 4 - Secure query time ------

Running 2m test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.342ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.52ms  431.76us   3.15ms   72.16%
    Req/Sec    10.77     32.18   111.00     89.90%
  1201 requests in 2.00m, 817.25KB read
Requests/sec:     10.01
Transfer/sec:      6.81KB