benchmark/time.txt

------ ROUND 1 - Insecure publish time ------

Running 2m test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.785ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.99ms    1.92ms  21.62ms   98.64%
    Req/Sec    10.37     30.97   111.00     89.89%
  1201 requests in 2.00m, 111.19KB read
Requests/sec:     10.01
Transfer/sec:      0.93KB

------ ROUND 2 - Insecure query time ------

Running 2m test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.404ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.20ms  528.17us   2.73ms   79.07%
    Req/Sec    10.62     31.71   111.00     89.88%
  1201 requests in 2.00m, 808.86KB read
Requests/sec:     10.01
Transfer/sec:      6.74KB

------ ROUND 3 - Secure publish time ------

Running 2m test @ http://localhost:7778/publish/size=631/pk|72d41281|type|123456|size|62|encrypted|0xdd--0xb1--0xb6--0xb8--0x22--0xd3--0x9a--0x76--0x1c--0xb6--0xc0--0x30--0x6a--0xe9--0x21--0x5a--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x00--0x73--0xe3--0xa6--0xf9--0x52--0xd2--0x97--0xa3--0xc1--0x10--0xf3--0xc5--0x05--0xcb--0x8e--0x1d--0x8b--0xe2--0xcf--0xcc--0x16--0x26--0x2c--0x4f--0x83--0x94--0xe4--0x9a--0xe0--0xee--0xb3--0x9c--0x50--0x63--0x68--0x4d--0x21--0x12--0xf0--0xa6--0x12--0xbc--0x86--0x9d--0xe1--0xa3--0x9b--0xd9--0xf9--0x31--0xd2--0x7c--0x63--0xe3--0x40--0x0e--0x08--0x17--0xd3--0xd2--0xf8--0xbf--0xbf--0xc0--0xee--0xea--0x4c--0xb7--0x90--0xdf--
  1 threads and 1 connections
  Thread calibration: mean lat.: 2.009ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.08ms    1.43ms  21.55ms   99.27%
    Req/Sec    10.48     31.31   111.00     89.89%
  1201 requests in 2.00m, 111.19KB read
Requests/sec:     10.01
Transfer/sec:      0.93KB

------ ROUND 4 - Secure query time ------

Running 2m test @ http://localhost:7778/query/size=24/pk|72d41281|index|000000
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.383ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.60ms  319.13us   2.66ms   69.52%
    Req/Sec    10.84     32.38   111.00     89.90%
  1201 requests in 2.00m, 817.25KB read
Requests/sec:     10.01
Transfer/sec:      6.81KB